/**/
"Cancel" = "Cancelar";
/**/
"Delete" = "Eliminar";
/**/
"Open" = "Abrir";
/**/
"Edit" = "Editar";
/**/
"Yes" = "Sí";
/**/
"Finish" = "Finalizar";
/**/
"Done" = "Listo";
/**/
"Save" = "Guardar";
/**/
"Undo" = "Deshacer";
/**/
"Redo" = "Rehacer";
/**/
"OK" = "Aceptar";
/**/
"Yes Delete" = "Sí, eliminar";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Aplicar geometría";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Borrar geometría";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Eliminar Vértice";
/*Geometry Edit Action Name*/
"Insert Part" = "Insertar parte";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Insertar Vértice";
/*Geometry Edit Action Name*/
"Move Vertex" = "Mover Vértice";
/*Geometry Edit Action Name*/
"Remove Part" = "Quitar parte";

/*Collecting attachments*/
"Add" = "Añadir";
/*Collecting attachments*/
"Take Photo or Video" = "Hacer foto o vídeo";
/*Collecting attachments*/
"Choose From Library" = "Elegir de la biblioteca";
/*Collecting attachments*/
"Photo" = "Foto";
/*Collecting attachments*/
"Video" = "Vídeo";
/*Collecting attachments*/
"Save To Photo Library" = "Guardar en Galería de Fotos";
/*Collecting attachments*/
"Download" = "Descargar";

/*Date attribute*/
"Today" = "Hoy";

/**/
"Attachments" = "Adjuntos";
"Attributes" = "Atributos";

/**/
"Open in Safari" = "Abrir en Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Introduzca un número entre %i y %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Introducir un número entre el %@ y el %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Demasiados caracteres (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "El número está fuera del rango aceptable.";

/* BLOB, RASTER, etc */
"Field type not supported" = "No se admite el tipo de campo";

/**/
"%d of %d" = "%d de %d";

/**/
"Changing Feature Type" = "Cambiando el tipo de entidad";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Está cambiando el tipo de entidad; es posible que se sobrescriban algunos valores de campo. ¿Seguro que desea realizar esta acción?";

/**/
"Deleting Feature" = "Eliminando entidad";
"Are you sure you want to delete this feature?" = "¿Está seguro de que desea eliminar esta entidad?";

/**/
"Data for pie chart is invalid" = "Los datos para el gráfico circular no son válidos";
"No data to create a pie chart" = "No hay datos para crear un gráfico circular";
"No image to display" = "Ninguna imagen para mostrar";

/**/
"Created by %@ seconds ago" = "Creado por %@ hace unos segundos";

/**/
"Created by %@ a minute ago" = "Creado por %@ hace un minuto";

/**/
"Edited by %@ seconds ago" = "Editado por %@ hace unos segundos";

/**/
"Edited by %@ a minute ago" = "Editado por %@ hace un minuto";

/**/
"Created seconds ago" = "Creado hace unos segundos";

/**/
"Created a minute ago" = "Creado hace un minuto";

/**/
"Edited seconds ago" = "Editado hace unos segundos";

/**/
"Edited a minute ago" = "Editado hace un minuto";

/**/
"Created by %@ %d minutes ago" = "Creado por %@ hace %d minutos";

/**/
"Created by %@ an hour ago" = "Creado por %@ hace una hora";

/**/
"Created by %@ %d hours ago" = "Creado por %@ hace %d horas";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Creado por %@ el %@ a las %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Creado por %@ el %@ a las %@";

/**/
"Edited by %@ %d minutes ago" = "Editado por %@ hace %d minutos";

/**/
"Edited by %@ an hour ago" = "Editado por %@ hace una hora";

/**/
"Edited by %@ %d hours ago" = "Editado por %@ hace %d horas";

/**/
"Edited by %@ on %@ at %@ - day" = "Editado por %@ el %@ a las %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Editado por %@ el %@ a las %@";

/**/
"Created by %@" = "Creado por %@";

/**/
"Edited by %@" = "Editado por %@";

/**/
"Created %d minutes ago" = "Creado hace %d minutos";

/**/
"Created an hour ago" = "Creado hace una hora";

/**/
"Created %d hours ago" = "Creado hace %d horas";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Creado el %@ a las %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Creado el %@ a las %@";

/**/
"Edited %d minutes ago" = "Editado hace %d minutos";

/**/
"Edited an hour ago" = "Editado hace una hora";

/**/
"Edited %d hours ago" = "Editado hace %d horas";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Editado el %@ a las %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Editado el %@ a las %@";

/* Used to denote a required field */
"Required" = "Requerido";

/* Used for naming layers with no names */
"Layer %d" = "Capa %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "No se puede encontrar la dirección para la ubicación";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "No se puede encontrar la ubicación para la dirección";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "No se puede leer la dirección";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "No se ha encontrado el archivo";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "No se puede cargar el localizador";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Error interno del localizador";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "La geocodificación de intersecciones no es compatible con el localizador";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Propiedades del localizador no válidas";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Falta un campo obligatorio";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "El localizador no se ha iniciado";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Formato de localizador no compatible";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Transformación de la proyección no compatible";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Referencia espacial no compatible";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "No se admite la geocodificación inversa con este localizador.";

/* Network analyst errors */
"Cannot open network." = "No se puede abrir la red.";
"Cannot retrieve route task parameters." = "No se pueden recuperar los parámetros de tarea de la ruta.";
"Insufficient number of stops." = "Número insuficiente de paradas.";
"Stop (%@) was not located." = "La parada (%@) no se ha localizado.";
"Stop (%@) is located on a non traversable element." = "La parada (%@) se encuentra en un elemento que no se puede atravesar.";
"Stop (%@) is located on a soft restricted element." = "La parada (%@) se encuentra en un elemento con restricción indefinida.";
"Point barrer (%@) was not located." = "La barrera de punto (%@) no se ha localizado.";
"Point barrier (%@) has invalid added cost attribute name." = "La barrera de punto (%@) tiene un nombre de atributo de coste añadido no válido.";
"Line barrier (%@) has invalid scaled cost attribute name." = "La barrera de línea (%@) tiene un nombre de atributo de coste escalado no válido.";
"Line barrier (%@) does not cover any network elements." = "La barrera de línea (%@) no cubre ningún elemento de red.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "La barrera de polígono (%@) tiene un nombre de atributo de coste escalado no válido.";
"Polygon barrier (%@) does not cover any network elements." = "La barrera de polígono (%@) no cubre ningún elemento de red.";
"'%@' is an invalid impedance attribute." = "'%@' es un atributo de impedancia no válido.";
"'%@' restriction attribute is invalid." = "El atributo de restricción '%@' no es válido.";
"'%@' accumulate attribute is invalid." = "El atributo de acumulación '%@' no es válido.";
"'%@' is an invalid directions time attribute." = "'%@' es un atributo de tiempo de direcciones no válido.";
"Directions distance attribute is invalid." = "El atributo de distancia de direcciones no es válido.";
"Invalid attribute parameter attribute name (%@)." = "Nombre de atributo de parámetros de atributo no válido (%@).";
"Invalid attribute parameter parameter name (%@)." = "Nombre de parámetro de parámetros de atributo no válido (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Tipo de valor no válido para el atributo (%1$@) parámetro (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valor de uso restringido no válido para el atributo (%1$@) parámetro (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valor de uso restringido neutro para el atributo (%1$@) parámetro (%2$@).";
"Soft restricted element (%@) was traversed." = "El elemento con restricción indefinida (%@) se ha atravesado.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "La red no dispone de un atributo de jerarquía para realizar la planificación de ruta jerárquica.";
"No path can be found between a given pair of stops (%@)." = "No se puede encontrar ninguna ruta entre un par de paradas determinado (%@).";
"The input spatial reference is undefined." = "La referencia espacial de entrada no se ha definido.";
"The output spatial reference is undefined." = "La referencia espacial de salida no se ha definido.";
"The directions style is invalid." = "El estilo de las direcciones no es válido.";
"The directions language is invalid." = "El lenguaje de las direcciones no es válido.";
"Directions time and distance attributes do not match." = "Los atributos de distancia y tiempo de las direcciones no coinciden.";
"The directions road class attribute is invalid." = "El atributo de clase de carretera de las direcciones no es válido.";
"Unknown condition." = "Condición desconocida.";
"Invalid route task parameters." = "Parámetros de tarea de ruta no válidos.";
"Route task's solution cannot be found." = "La solución de la tarea de ruta no se encuentra.";
"Route task was cancelled." = "La tarea de ruta se ha cancelado.";
"Route task internal error." = "Error interno en la tarea de ruta.";
"Route name property is not supported for local route task." = "La propiedad de nombre de la ruta no es compatible para la tarea de ruta local.";
"Local route task parameters should be retrieved from route task." = "Los parámetros de tarea de ruta local deben recuperarse de la tarea de ruta.";
"Cannot retrieve network description." = "No se puede recuperar la descripción de la red.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Solo se puede especificar un atributo de longitud para impedanceAttributeName y accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Solo se puede especificar un atributo de tiempo para impedanceAttributeName y accumulateAttributeNames.";
"Service not supported." = "Servicio no admitido.";
"Specified start time occurs before January 1, 1970." = "La hora de inicio especificada es anterior al 1 de enero de 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "La parada (%@) tiene una hora de inicio anterior al 1 de enero de 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "La parada (%@) tiene un intervalo de hora local anterior al 1 de enero de 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "La parada (%@) tiene un intervalo de hora UTC anterior al 1 de enero de 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "La parada (%@) tiene un final de intervalo de hora anterior al inicio del intervalo.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "pies";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Desconocido";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centímetros";
"Decimal Degrees" = "Grados decimales";
"Decimeters" = "Decímetros";
"Feet" = "Pies";
"Inches" = "Pulgadas";
"Kilometers" = "Kilómetros";
"Meters" = "Metros";
"Miles" = "Millas";
"Millimeters" = "Milímetros";
"Nautical Miles" = "Millas náuticas";
"Points" = "Puntos";
"Yards" = "Yardas";

/* Area Units Abbreviated Strings */
"sq. in" = "in2";
"sq. ft" = "ft2";
"sq. yd" = "yd2";
"ac" = "ac";
"sq. mi" = "mi2";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "áreas";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Pulgadas cuadradas";
"Square Feet" = "Pies cuadrados";
"Square Yards" = "Yardas cuadradas";
"Acres" = "Acres";
"Square Miles" = "Millas cuadradas";
"Square Millimeters" = "Milímetros cuadrados";
"Square Centimeters" = "Centímetros cuadrados";
"Square Decimeters" = "Decímetros cuadrados";
"Square Meters" = "Metros cuadrados";
"Ares" = "Áreas";
"Hectares" = "Hectáreas";
"Square Kilometers" = "Kilómetros cuadrados";

/* Errors */
"Error" = "Error";
"Class not @protocol AGSJSONSerializable compliant" = "Clase no compatible con @protocol AGSJSONSerializable";
"Authorization required" = "Autorización necesaria";
"Token is invalid or has expired" = "El token no es válido o ha caducado";
"Unknown error occurred" = "Se ha producido un error desconocido";
"Empty username/password" = "Nombre de usuario/contraseña vacío";
"Token URL is nil. You must set a valid token URL on the credential." = "No hay ninguna URL de token. Debe definir una URL de token válida en la credencial.";
"Unknown authentication error" = "Error de autenticación desconocido";
"Error extracting identity" = "Error al extraer la identidad";
"Error adding identity to the keychain" = "Error al agregar la identidad a la cadena de claves";
"Invalid Credentials" = "Credenciales no válidas";
"Bad URL." = "URL incorrecta.";
"The feature layer does not expose an object-id field." = "La capa de entidades no expone un campo de ID de objeto.";
"Both geodatabase and syncParams are required for this method." = "Se necesita la geodatabase y syncParams para este método.";
"Uploading deltas is not supported with this replica." = "No se admite la carga de deltas con esta réplica.";
"Error creating delta geodatabase" = "Error al crear la geodatabase delta";
"Unable to create result image layer" = "No se puede crear la capa de imagen resultante";
"Cache at path '%@' not found." = "No se ha encontrado la memoria caché en la ruta '%@'.";
"To add an item, you must be logged in to the portal." = "Para agregar un elemento, debe iniciar sesión en el portal.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Para agregar un elemento, debe especificar un valor en AGSPortalItemContentParameters.";
"The portal failed to add the item." = "El portal no ha podido agregar el elemento.";
"To delete an item, you must be logged in to the portal." = "Para eliminar un elemento, debe iniciar sesión en el portal.";
"The portal failed to delete the item." = "El portal no ha podido eliminar el elemento.";
"To update an item, an itemId and logged in user are required." = "Para actualizar un elemento, se necesita un ID de elemento y un usuario conectado.";
"The item failed to update." = "No se ha podido actualizar el elemento.";
"The item failed to update JSON." = "El elemento no ha podido actualizar JSON.";
"You must be logged in to a portal to add a comment." = "Debe haber iniciado sesión en el portal para agregar un comentario.";
"The comment failed to be added." = "El comentario no se ha podido agregar.";
"You must be logged in to a portal to fetch the current user's rating." = "Debe haber iniciado sesión en un portal para recuperar la calificación actual del usuario.";
"You must be logged in to a portal to add a rating." = "Debe haber iniciado sesión en un portal para agregar una calificación.";
"The rating failed to be added." = "No se ha podido agregar la calificación.";
"To share an item, you must be logged in to the portal." = "Para compartir un elemento, debe haber iniciado sesión en el portal.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Para dejar de compartir un elemento, debe iniciar sesión en el portal y especificar los grupos con los que quiere dejar de compartir el elemento.";
"Bad Request" = "Solicitud incorrecta";
"Credential Required" = "AGSCredential necesaria";
"Job not created" = "Trabajo no creado";
"Service did not return a valid URL" = "El servicio no ha devuelto una URL válida";
"Service did not return a file" = "El servicio no ha devuelto un archivo";
"Service did not return a size" = "El servicio no ha devuelto un tamaño";
"Job failed" = "Error en el trabajo";
"Job timed out" = "Se agotó el tiempo de espera del trabajo";
"Job was cancelled" = "Se canceló el trabajo";
"Job was deleted" = "Se eliminó el trabajo";
"Feature with objectId: %d not found" = "Entidad con Id. de objeto: %d no encontrada";
"No object-id values specified for feature table query." = "No se han especificado valores de Id. de objeto para la consulta de la tabla de entidades.";

/* OAuth */
"The specified clientID is invalid" = "El Id. de cliente especificado no es válido";

/* Sync */
"Upload is not supported with this service." = "La carga no está admitida con este servicio.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Para ejecutar la sincronización, se debe especificar una dirección de sincronización distinta de AGSGDBSyncDirectionNone.";